ConvergingDivergingNozzle/OpenFOAM-2.3.0/nozzle-tet-netgen/0/emptySymmetry.include
    symmetry-plane
    {
	type		symmetryPlane;
    }
    defaultFaces
    {
        type            empty;
    }



