ConvergingDivergingNozzle/OpenFOAM-2.3.0/nozzle-tet-netgen/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          diagonal;
    }
    
    U
    {
//        solver          PBiCG;
//        preconditioner	DILU;
        tolerance       1e-09;
        relTol          0.0;
        solver		smoothSolver;
        smoother	DILUGaussSeidel;
    }
    
    p
    {
        solver          PBiCG;
        preconditioner	DILU;
        tolerance       1e-09;
        relTol          0.0;
    }

    "(h|k|omega)"
    {
        $U;
        solver		smoothSolver;
        smoother	DILUGaussSeidel;
    }
}

PIMPLE
{
    momentumPredictor	true;
    nNonOrthogonalCorrectors 1;
    nCorrectors		2;
    nonOrthogonalityThreshold	45.0;
    skewnessThreshold		0.5;
}

// ************************************************************************* //
